Catalogs/Нумераторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Нумераторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьНумераторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоСвязанномуДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоПодразделению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоПроекту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоВопросуДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоВидуДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Нумераторы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей Нумераторов
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     Периодичность
//     ФорматНомера
//     НезависимаяНумерацияПоОрганизациям
//     НезависимаяНумерацияПоПодразделению
//     НезависимаяНумерацияПоВидуДокумента
//     НезависимаяНумерацияПоПроекту
//     НезависимаяНумерацияПоВопросуДеятельности
//     ТипСвязи
//
Функция ПолучитьСтруктуруНумераторов() Экспорт
	
	ПараметрыНумераторов = Новый Структура;
	ПараметрыНумераторов.Вставить("Наименование");
	ПараметрыНумераторов.Вставить("Периодичность");
	ПараметрыНумераторов.Вставить("ФорматНомера");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоОрганизациям");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоСвязанномуДокументу");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПодразделению");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВидуДокумента");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПроекту");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВопросуДеятельности");
	ПараметрыНумераторов.Вставить("ТипСвязи");
	
	Возврат ПараметрыНумераторов;
	
КонецФункции

// Создает и записывает в БД Нумератор
//
// Параметры:
//   СтруктураНумератора - Структура - структура полей нумераторов.
//
Функция СоздатьНумератор(СтруктураНумератора) Экспорт
	
	НовыйНумератор = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйНумератор, СтруктураНумератора);
	НовыйНумератор.Записать();
	
	Возврат НовыйНумератор.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
